trade_exp/src/InformationRegisters/ЦеновыеГруппыБезБонусов/ЦеновыеГруппыБезБонусов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="6086962b-74f5-4a58-ae6a-5d03ab6b987a">
  <name>ЦеновыеГруппыБезБонусов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="047bb1a5-c6b2-46eb-a0d1-ab19e6518501">
    <name>ДатаОкончанияДействия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="f64f784a-7d5b-472e-8496-3c3b5d0e45f1">
    <name>ЦеноваяГруппа</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/ЦеновыеГруппыБезБонусов/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.ЗапретИзмененияДатыНачала Тогда
		Элементы.ЦеноваяГруппа.Доступность = Ложь;
		Элементы.Период.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Элементы.Период.Доступность И Запись.Период < НачалоДня(ТекущаяДата()) Тогда
		Отказ = Истина;                                            
		Сообщить("Дата начала действия не может быть меньше текущей даты");
		
	ИначеЕсли ЗначениеЗаполнено(Запись.ДатаОкончанияДействия) И Запись.ДатаОкончанияДействия < НачалоДня(ТекущаяДата()) Тогда
		Отказ = Истина;                                            
		Сообщить("Дата окончания действия не может быть меньше текущей даты");
		
	ИначеЕсли ЗначениеЗаполнено(Запись.ДатаОкончанияДействия) И Запись.Период > НачалоДня(Запись.ДатаОкончанияДействия) Тогда
		Отказ = Истина;
		Сообщить("Дата начала не может быть больше даты окончания");
	КонецЕсли;
КонецПроцедуры   

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ 
	|	ЦеноваяГруппа, 
	|	Период,        
	|	ВЫБОР 
	|		КОГДА
	|			ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1) 
	|		ТОГДА
	|			ДАТАВРЕМЯ(3000, 1, 1)
	|	ИНАЧЕ                    
	|		ДатаОкончанияДействия
	|	КОНЕЦ КАК ДатаОкончанияДействия
	|ПОМЕСТИТЬ
	|	втЦеновыеГруппыБезБонусов			
	|ИЗ
	|	РегистрСведений.ЦеновыеГруппыБезБонусов     
	|ГДЕ
	|	ЦеноваяГруппа = &ЦеноваяГруппа   
	|	И Период <> &ДатаНачалаДействия  
	|;
	|//////////////////////////////////////////////
	|ВЫБРАТЬ 
	|	ЦеноваяГруппа, 
	|	Период,        
	|	ДатаОкончанияДействия
	|ИЗ
	|	втЦеновыеГруппыБезБонусов			
	|ГДЕ 
	|	(&ДатаНачалаДействия >= Период
	|	И &ДатаНачалаДействия <= ДатаОкончанияДействия)
	|ИЛИ 	
	|	(&ДатаОкончанияДействия >= Период
	|	И &ДатаОкончанияДействия <= ДатаОкончанияДействия)";
	
	Запрос.УстановитьПараметр("ЦеноваяГруппа", Запись.ЦеноваяГруппа);
	Запрос.УстановитьПараметр("ДатаНачалаДействия", Запись.Период);
	Запрос.УстановитьПараметр("ДатаОкончанияДействия", ?(ЗначениеЗаполнено(Запись.ДатаОкончанияДействия), Запись.ДатаОкончанияДействия, Дата("30000101"))); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Отказ = Истина;				
		Сообщить("Выбранный период действия пересекается с периодом " 
				+ Формат(Выборка.Период, "ДЛФ=D") + " - " 
				+ ?(Выборка.ДатаОкончанияДействия <> Дата("30000101"), Формат(Выборка.ДатаОкончанияДействия, "ДЛФ=D"), "Не ограничено"));
	КонецЕсли;
КонецПроцедуры
